migration/judge/mutations/02-cast-string-double-error-dropped.patch
diff --git a/src/sql/engine/expr/ob_datum_cast.cpp b/src/sql/engine/expr/ob_datum_cast.cpp
index 1134ebf..29f7cec 100644
--- a/src/sql/engine/expr/ob_datum_cast.cpp
+++ b/src/sql/engine/expr/ob_datum_cast.cpp
@@ -787,15 +787,7 @@ int common_string_double(const ObExpr &expr,
           ret = OB_ERR_DOUBLE_TRUNCATED;
         }
       } else if (OB_FAIL(check_convert_str_err(in_str.ptr(), endptr, in_str.length(), err, in_cs_type))) {
-        if (CM_IS_COLUMN_CONVERT(expr.extra_) && ret == OB_ERR_DATA_TRUNCATED) {
-          // do nothing, compatible mysql, retain OB_ERR_DATA_TRUNCATED error code in column_convert.
-        } else {
-          ret = OB_ERR_DOUBLE_TRUNCATED;
-        }
-        if (CM_IS_WARN_ON_FAIL(expr.extra_)) {
-          ret = OB_ERR_DOUBLE_TRUNCATED;
-          LOG_USER_WARN(OB_ERR_DOUBLE_TRUNCATED, in_str.length(), in_str.ptr());
-        }
+        ret = OB_SUCCESS;
       }
     }
   }
