migration/judge/mutations/04-number-ceil-carry-dropped.patch
diff --git a/src/oblib/common/number/ob_number_v2.cpp b/src/oblib/common/number/ob_number_v2.cpp
index ed450ae..22831a8 100644
--- a/src/oblib/common/number/ob_number_v2.cpp
+++ b/src/oblib/common/number/ob_number_v2.cpp
@@ -959,7 +959,7 @@ int ObNumber::ceil(const int64_t scale)
         digits_[i] = 0;
       }
       d_.len_ = static_cast<uint8_t>(int_len);
-      if (POSITIVE == d_.sign_) {
+      if (NEGATIVE == d_.sign_) {
         for (int64_t i = int_len - 1; i >= 0; --i) {
           if ((BASE - 1) != digits_[i]) {
             digits_[i] += 1;
